# Min Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BoundingBoxXYZ..::..Min Property
BoundingBoxXYZ Class See Also
---
Minimum coordinates (lower-left-rear corner of the box).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ Min { get; set; }
```

Visual Basic
---
```text
Public Property Min As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ Min {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Remarks
The bounds are defined in the coordinate space of the box.
# See Also
BoundingBoxXYZ Class
Autodesk.Revit.DB Namespace